In [1]:
import pandas as pd
import numpy as np

## Pivot

In [2]:
import pandas as pd

#Creamos un dataframe
df = pd.DataFrame(
    {'A': ['John', 'Boby', 'Mina'],
     'B': ['Masters', 'Graduate', 'Graduate'],
     'C': [27, 23, 21]}
    )

In [3]:
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [4]:
df.pivot(index ='A', columns ='B', values =['C'])

            C
B    Graduate Masters
A
Boby     23.0     NaN
John      NaN    27.0
Mina     21.0     NaN

## Apply

In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=['A','B','C'])
print (df)

def add_2(x):
    return x+2 #a cada elemento le suma 2

df = df.apply(add_2)
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   A   B   C
0  3   4   5
1  6   7   8
2  9  10  11

In [6]:
#Aplicacion de la funcion apply () a una sola columna

import pandas as pd
import numpy as np

df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=['A','B','C'])
print (df)

def add_2(x):
    return x+2

df['A'] = df['A'].apply(add_2)
print (df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  3  2  3
1  6  5  6
2  9  8  9

## Merge

In [7]:
import pandas as pd

# Datos de ejemplo: DataFrame de empleados
data_empleados = {'id_empleado': [1, 2, 3, 4],
                  'nombre': ['Alice', 'Bob', 'Charlie', 'David']}
df_empleados = pd.DataFrame(data_empleados)

# Datos de ejemplo: DataFrame de departamentos
data_departamentos = {'id_empleado': [1, 3, 4, 5],
                      'departamento': ['HR', 'IT', 'Finance', 'Admin']}
df_departamentos = pd.DataFrame(data_departamentos)

# Merge basado en la columna 'id_empleado'
merged_df = pd.merge(df_empleados, df_departamentos, on='id_empleado', how='inner')

print(merged_df)

   id_empleado   nombre departamento
0            1    Alice           HR
1            3  Charlie           IT
2            4    David      Finance

## Concat

In [8]:
# Concatenación por filas
concatenated_df = pd.concat([df_empleados, df_departamentos], axis=0)

print(concatenated_df)

   id_empleado   nombre departamento
0            1    Alice          NaN
1            2      Bob          NaN
2            3  Charlie          NaN
3            4    David          NaN
0            1      NaN           HR
1            3      NaN           IT
2            4      NaN      Finance
3            5      NaN        Admin

En este ejemplo, concatenated_df contendrá los datos de empleados y departamentos concatenados por filas.

Ten en cuenta que en ambos casos, los DataFrames deben tener una estructura de datos similar (mismo número de columnas) para realizar la operación de manera adecuada.